import React from "react";
import { decodeHtml } from "../utils/decodeHtml";

const Test = () => {
  let obj = {
    dis: "<p>પર્યાવરણ આપણાં જીવનનું - શ્રુસ્ટીનું આવરણ છે.આ મહત્વના આવરણને બચાવવું આપણા માટે અનિવાર્ય છે.પર્યાવરણને થઈ રહેલી નુકસાની આપણા માટે આવનારા સમયનો ગંભીર ખતરો બની રહી છે. મહાત્મા ગાંધી પર્યાવરણની જાળવણી પ્રત્યે ખૂબ જ સજાગ હતા.સ્વયંમ પોતે દરરોજ સવારે સાબરમતી આશ્રમના ફુલઝાડની માવજત કરતા હતા.પોતાની જાહેર સભા સ્થળની</p><p><br></p><p> વ્યવસ્થા દરમિયાન કોઈપણ ઝાડપાન ને જરા પણ નુકશાન ન પહોંચે એનું ખાસ ધ્યાન રાખતા હતા.પર્યાવરણની જાળવણી માટે આપણે પણ જાગૃત અને પ્રયતશીલ થવું જોઈએ.પર્યાવરણની જાળવણીની શરુઆત આપણે આપણા ઘરેથી પણ કરી શકીએ આપણા ફળિયા વિસ્તારમાં ઓછામાં ઓછું એક વૃક્ષ ઉછેરીએ અને આસપાસના અન્ય મોટાં વૃક્ષોની જાળવણી કરીયે.પર્યાવરણ જાળવણી વિષય સલગ્ન વિવિધ સામાજિક સંસ્થાઓ દ્વારા ચાલતી પ્રવૃતિઓમાં સક્રિય ભાગ લઈએ.</p><p><br></p><p>આપણા પોતના અંગત નાના મોટા લાભ માટે આપણી આસપાસના ઝાડપાન ને કદાપિ નુકસાન ન પહોંચાડીએ. ⁠નદી, જંગલ કે અન્ય પ્રાકૃતિક વિસ્તારમાં હરવા - ફરવા જઈએ ત્યારે સિંગલ યુઝડ</p><p><br></p><p>પ્લાસ્ટિકનો કચરો ન ફેલાય એનું ખાસ ધ્યાન રાખીયે.નાના મોટી પ્રવૃત્તિ દ્વારા માનવીય વર્તણુક બદલાવ માટેની શરૂઆત સ્વયંમ પોતાનાથી કરીયે અને ત્યારબાદ પર્યાવરણ જાળવણી સલગ્ન માહિતી અન્ય 5 મિત્રો સાથે શેર કરીયે.</p><p><br></p>",
  };

  return (
    <>
      <div
        className="my"
        dangerouslySetInnerHTML={{
          __html: decodeHtml(obj.dis),
        }}
      />
    </>
  );
};

export default Test;
